maxgerhardt/framework-aurduino/ShieldBuddyTC375/aurix/variants/TC375/Variant.h
/* Analog pins with digital option */
#define A4A_IN P10_IN.B.P8
#define A5A_IN P10_IN.B.P7

#define A12A_IN P20_IN.B.P9
#define A12B_IN P33_IN.B.P10
#define A13A_IN P33_IN.B.P11
#define A14A_IN P20_IN.B.P7
#define A15A_IN P20_IN.B.P8


/* Fast port access macros */
#define Fast_digitalWriteAB(port, val) 	(port##_OUT=val)
#define Fast_digitalReadAB(port) 		(port##_IN)

//#define Fast_digitalWrite(port, val) (D##port##_OUT=val)
#define Fast_digitalRead(port) 		 (D##port##_IN)

/* Superfast Pin Access Definitions */
#define D0_OMSR 	P15_OMSR.U
#define D0_OMCR 	P15_OMCR.U
#define D0_index 	3

#define D1_OMSR 	P15_OMSR.U
#define D1_OMCR 	P15_OMCR.U
#define D1_index 	2

#define D2_OMSR 	P02_OMSR.U
#define D2_OMCR 	P02_OMCR.U
#define D2_index 	0

#define D3_OMSR 	P02_OMSR.U
#define D3_OMCR 	P02_OMCR.U
#define D3_index 	1

#define D4_OMSR 	P10_OMSR.U
#define D4_OMCR 	P10_OMCR.U
#define D4_index 	4

#define D5_OMSR 	P02_OMSR.U
#define D5_OMCR 	P02_OMCR.U
#define D5_index 	3

#define D6_OMSR 	P02_OMSR.U
#define D6_OMCR 	P02_OMCR.U
#define D6_index 	4

#define D7_OMSR 	P02_OMSR.U
#define D7_OMCR 	P02_OMCR.U
#define D7_index 	5

#define D8_OMSR 	P02_OMSR.U
#define D8_OMCR 	P02_OMCR.U
#define D8_index 	6

#define D9_OMSR 	P02_OMSR.U
#define D9_OMCR 	P02_OMCR.U
#define D9_index 	7

#define D10_OMSR 	P10_OMSR.U
#define D10_OMCR 	P10_OMCR.U
#define D10_index 	5

#define D11_OMSR 	P10_OMSR.U
#define D11_OMCR 	P10_OMCR.U
#define D11_index 	3

#define D12_OMSR 	P10_OMSR.U
#define D12_OMCR 	P10_OMCR.U
#define D12_index 	1

#define D13_OMSR 	P10_OMSR.U
#define D13_OMCR 	P10_OMCR.U
#define D13_index 	2

#define D14_OMSR 	P15_OMSR.U
#define D14_OMCR 	P15_OMCR.U
#define D14_index 	0

#define D15_OMSR 	P15_OMSR.U
#define D15_OMCR 	P15_OMCR.U
#define D15_index 	1

#define D16_OMSR 	P33_OMSR.U
#define D16_OMCR 	P33_OMCR.U
#define D16_index 	9

#define D17_OMSR 	P33_OMSR.U
#define D17_OMCR 	P33_OMCR.U
#define D17_index 	8

#define D18_OMSR 	P20_OMSR.U
#define D18_OMCR 	P20_OMCR.U
#define D18_index 	0

#define D19_OMSR 	P20_OMSR.U
#define D19_OMCR 	P20_OMCR.U
#define D19_index 	3

#define D20_OMSR 	P20_OMSR.U
#define D20_OMCR 	P20_OMCR.U
#define D20_index 	4

#define D21_OMSR 	P20_OMSR.U
#define D21_OMCR 	P20_OMCR.U
#define D21_index 	5

#define D22_OMSR 	P14_OMSR.U
#define D22_OMCR 	P14_OMCR.U
#define D22_index 	0

#define D23_OMSR 	P14_OMSR.U
#define D23_OMCR 	P14_OMCR.U
#define D23_index 	1

#define D24_OMSR 	P15_OMSR.U
#define D24_OMCR 	P15_OMCR.U
#define D24_index 	6

#define D25_OMSR 	P00_OMSR.U
#define D25_OMCR 	P00_OMCR.U
#define D25_index 	0

#define D26_OMSR 	P00_OMSR.U
#define D26_OMCR 	P00_OMCR.U
#define D26_index 	8

#define D27_OMSR 	P00_OMSR.U
#define D27_OMCR 	P00_OMCR.U
#define D27_index 	1

#define D28_OMSR 	P00_OMSR.U
#define D28_OMCR 	P00_OMCR.U
#define D28_index 	9

#define D29_OMSR 	P00_OMSR.U
#define D29_OMCR 	P00_OMCR.U
#define D29_index 	2

#define D30_OMSR 	P00_OMSR.U
#define D30_OMCR 	P00_OMCR.U
#define D30_index 	10

#define D31_OMSR 	P00_OMSR.U
#define D31_OMCR 	P00_OMCR.U
#define D31_index 	3

#define D32_OMSR 	P00_OMSR.U
#define D32_OMCR 	P00_OMCR.U
#define D32_index 	11

#define D33_OMSR 	P00_OMSR.U
#define D33_OMCR 	P00_OMCR.U
#define D33_index 	4

#define D34_OMSR 	P00_OMSR.U
#define D34_OMCR 	P00_OMCR.U
#define D34_index 	12

#define D35_OMSR 	P00_OMSR.U
#define D35_OMCR 	P00_OMCR.U
#define D35_index 	5

#define D36_OMSR 	P33_OMSR.U
#define D36_OMCR 	P33_OMCR.U
#define D36_index 	2

#define D37_OMSR 	P00_OMSR.U
#define D37_OMCR 	P00_OMCR.U
#define D37_index 	6

#define D38_OMSR 	P33_OMSR.U
#define D38_OMCR 	P33_OMCR.U
#define D38_index 	1

#define D39_OMSR 	P00_OMSR.U
#define D39_OMCR 	P00_OMCR.U
#define D39_index 	7

#define D40_OMSR 	P33_OMSR.U
#define D40_OMCR 	P33_OMCR.U
#define D40_index 	0

#define D41_OMSR 	P11_OMSR.U
#define D41_OMCR 	P11_OMCR.U
#define D41_index 	9

#define D42_OMSR 	P11_OMSR.U
#define D42_OMCR 	P11_OMCR.U
#define D42_index 	3

#define D43_OMSR 	P11_OMSR.U
#define D43_OMCR 	P11_OMCR.U
#define D43_index 	11

#define D44_OMSR 	P33_OMSR.U
#define D44_OMCR 	P33_OMCR.U
#define D44_index 	3

#define D45_OMSR 	P11_OMSR.U
#define D45_OMCR 	P11_OMCR.U
#define D45_index 	2

#define D46_OMSR 	P11_OMSR.U
#define D46_OMCR 	P11_OMCR.U
#define D46_index 	3

#define D47_OMSR 	P11_OMSR.U
#define D47_OMCR 	P11_OMCR.U
#define D47_index 	6

#define D48_OMSR 	P21_OMSR.U
#define D48_OMCR 	P21_OMCR.U
#define D48_index 	3

#define D49_OMSR 	P21_OMSR.U
#define D49_OMCR 	P21_OMCR.U
#define D49_index 	0

#define D50A_OMSR 	P21_OMSR.U
#define D50A_OMCR 	P21_OMCR.U
#define D50A_index 	2

#define D51A_OMSR 	P13_OMSR.U
#define D51A_OMCR 	P13_OMCR.U
#define D51A_index 	3

#define D52A_OMSR 	P15_OMSR.U
#define D52A_OMCR 	P15_OMCR.U
#define D52A_index 	8

#define D53A_OMSR 	P20_OMSR.U
#define D53A_OMCR 	P20_OMCR.U
#define D53A_index 	10

#define D54_OMSR 	P13_OMSR.U
#define D54_OMCR 	P13_OMCR.U
#define D54_index 	2

#define D55_OMSR 	P13_OMSR.U
#define D55_OMCR 	P13_OMCR.U
#define D55_index 	1

#define Fast_digitalWrite(pin, val) (val==1)?(D##pin##_OMSR=(1<<D##pin##_index)):(D##pin##_OMCR=(0x00010000ul<<D##pin##_index));


/*
 * DACC
 */
#define DACC_INTERFACE		DACC
#define DACC_INTERFACE_ID	ID_DACC
#define DACC_RESOLUTION		12
#define DACC_ISR_HANDLER    DACC_Handler
#define DACC_ISR_ID         DACC_IRQn

/*
 * PWM
 */
#define PWM_INTERFACE		PWM
#define PWM_INTERFACE_ID	ID_PWM
#define PWM_FREQUENCY		1000
#define PWM_MAX_DUTY_CYCLE	255
#define PWM_MIN_DUTY_CYCLE	0
#define PWM_RESOLUTION		8

/*
 * TC
 */
#define TC_INTERFACE        TC0
#define TC_INTERFACE_ID     ID_TC0
#define TC_FREQUENCY        1000
#define TC_MAX_DUTY_CYCLE   255
#define TC_MIN_DUTY_CYCLE   0
#define TC_RESOLUTION		8

/* Interrupt priorities (visible globally) */
/* There are 255 levels 				   */
#define IFX_INTPRIO_INTERCORE_ISR	1
#define IFX_INTPRIO_STM0SRN0_ISR    255  /* Arduino tick system */
#define IFX_INTPRIO_STM0SRN1_ISR	3
#define IFX_INTPRIO_STM1SRN0_ISR	4
#define IFX_INTPRIO_STM2SRN0_ISR	5
#define IFX_INTPRIO_STM2SRN1_ISR	6
#define IFX_INTPRIO_STM1SRN1_ISR	7

